local G = require("G")
G.map({
  -- 删除当前缓冲区
  { "n", "<leader>bd", ":bdelete<CR>" },

  -- 上下滚屏
  { "n", "<C-u>", "9k" },
  { "n", "<C-d>", "9j" },

  -- 缩进代码
  { "v", "<", "<gv" },
  { "v", ">", ">gv" },

  -- 跳转窗口
  { "n", "<A-h>", "<C-w>h" },
  { "n", "<A-j>", "<C-w>j" },
  { "n", "<A-k>", "<C-w>k" },
  { "n", "<A-l>", "<C-w>l" },

  -- 将窗口移动到指定位置
  { "n", "<A-H>", "<C-w>H" },
  { "n", "<A-J>", "<C-w>J" },
  { "n", "<A-K>", "<C-w>K" },
  { "n", "<A-L>", "<C-w>L" },

  -- 调整窗口大小
  { "n", "<A-up>", "<C-w>10+" },
  { "n", "<A-down>", "<C-w>10-" },
  { "n", "<A-left>", "<C-w>10<" },
  { "n", "<A-right>", "<C-w>10>" },

  -- 在插入模式下移动光标
  { "i", "<A-h>", "<left>" },
  { "i", "<A-j>", "<down>" },
  { "i", "<A-k>", "<up>" },
  { "i", "<A-l>", "<right>" },

  -- 快速跳转到一行的开头或结尾
  { "n", "L", "$" },
  { "n", "H", "^" },

  -- 保存当前文件
  { "n", "<leader>w", ":w<CR>" },

  -- 保存当前文件并退出
  { "n", "<leader>Q", ":wq<CR>" },
})
